<?php

return [

    'game_exists' => 'لا يمكنك إنشاء غرفة جديدة لأنك داخل لعبة حالياً.',
    'game_created' => 'تم إنشاء الغرفة بنجاح.',

    'join_full' => 'الغرفة ممتلئة، لا يمكنك الانضمام.',
    'join_exists' => 'أنت موجود مسبقاً داخل اللعبة.',
    'join_success' => 'تم الانضمام إلى اللعبة بنجاح.',

    'leave_owner_transferred' => 'تم نقل ملكية الغرفة للاعب التالي ومغادرة الغرفة.',
    'leave_deleted' => 'تم حذف الغرفة لأنها أصبحت فارغة.',
    'leave_success' => 'تمت مغادرة اللعبة بنجاح.',

    'kick_self' => 'لا يمكنك طرد نفسك لأنك صاحب الغرفة.',
    'kick_not_found' => 'هذا اللاعب غير موجود داخل هذه الغرفة.',
    'kick_after_start' => 'لا يمكن طرد اللاعبين بعد بدء اللعبة.',
    'kick_success' => 'تم طرد اللاعب بنجاح.',
    'kick_deleted' => 'تم حذف اللاعب، الغرفة أصبحت فارغة.',

    'start_already' => 'اللعبة بدأت بالفعل.',
    'start_finished' => 'لا يمكن بدء لعبة منتهية.',
    'start_success' => 'تم بدء اللعبة بنجاح.',

    'details_success' => 'تم جلب تفاصيل اللعبة بنجاح.',
 "created_success"=>'تم انشاء اللعبة بنجاح',
    'not_found' => 'اللعبة غير موجودة.',
    'fetched' => 'تم جلب تفاصيل اللعبة بنجاح.',
    'not_in_game' => 'أنت حالياً لست داخل أي لعبة.',
    'current_game' => 'تم جلب اللعبة الحالية.',
'cannot_create_in_game'=>'sasas'
];
